{"text": "Objectives: This study investigated the acute effects of pre-exercise cold-water immersion (CWI) on performance, muscle oxygen saturation, and mechanical muscle tension during calf raise training. Method: Twenty-four trained individuals (5 females, 19 males) were randomly assigned to either a CWI group (5 min at 10 ± 1 °C) or a non-CWI group (no intervention). Both groups performed three sets of standing calf raises to failure using a standardized protocol. Load lifted, repetitions, and rate of perceived exertion (RPE) were recorded. Muscle oxygenation (SmO2, total hemoglobin) and mechanical muscle properties (frequency and stiffness) were measured before and after each set. Results: The CWI group showed a significantly greater increase in barbell load from set 1 to set 2 compared to the non-CWI group (from 94.5 ± 18.1 kg to 98.0 ± 18.7 kg, p < 0.01). Repetitions decreased and RPE increased across sets in both groups. The non-CWI group exhibited earlier..."}
{"text": "Heart rate variability (HRV), as an indicator of autonomic control, has been rarely studied during strength training application. This study investigates the acute HRV responses to intensity-matched resistance exercises, targeting similar muscle groups but performed in different body positions. Fourteen healthy females (21.6 ± 2.0 years) performed a 3-repetition maximum test (3-RM) for the squat movement in the Smith machine (SM, upright) and the leg press (LP, seated). During two subsequent visits, they randomly completed two exercise sessions in SM and LP (two sets of 10 repetitions at 50% 3-RM). HRV was assessed continuously (via ECG) throughout the interventions. At pre-exercise, the Root Mean Square of Successive Differences (RMSSD) and RR intervals (RRI) were significantly higher for the LP condition. Alpha1 of Detrended Fluctuation Analysis (DFAa1) was significantly higher with SM at rest. During exercise sessions, the LP condition revealed significantly reduced RMSSD (∆exercise: SM -1.19 ± 14.57 ms vs...."}
{"text": "Background/Objectives: Heart rate variability (HRV) is a reliable, non-invasive marker of autonomic nervous system function and is often impaired in individuals with metabolic syndrome (MetS). Physical exercise has emerged as an effective strategy to improve autonomic modulation; however, the comparative effects of different training modalities on HRV in individuals with MetS remain unclear. This systematic review and meta-analysis aimed to evaluate the impact of various exercise interventions on HRV and to identify which training types yield the most significant improvements. Methods: A systematic search was conducted in PubMed and Scopus up to April 2025. Eligible studies (n = 16) included adults with obesity and MetS (n = 752) who underwent structured exercise interventions with HRV assessments pre- and post-intervention. Standardized mean differences were calculated using random effects models. Subgroup analyses were performed based on training modality (endurance training [ET], resistance training [RT], high-intensity interval training [HIIT], and concurrent training [CT])...."}
{"text": "Resistance training plays a key role in enhancing muscular performance; however, the effects of different combinations of loading intensity and velocity loss (VL) thresholds on muscle oxygen saturation (SmO2) dynamics during exercise remain insufficiently understood. This study aimed to investigate the influence of intensity (60% vs. 80% one-repetition maximum [1RM]) and VL (20% vs. 40%) on SmO2 responses during the back squat exercise. Eighteen resistance-trained males (age: 20.06 ± 1.63 years; height: 176.78 ± 6.45 cm; body mass: 70.26 ± 9.56 kg) performed four back squat protocols - 60%1RM-VL20% (60-20), 60%1RM-VL40% (60-40), 80%1RM-VL20% (80-20), and 80%1RM-VL40% (80-40) - using a repeated-measures, counterbalanced design. Each protocol comprised three sets with 5-minute inter-set rest periods. SmO2 of the vastus lateralis was continuously monitored to determine changes in its magnitude and slope during exercise and recovery phases. Results revealed no significant differences were observed in the magnitude of SmO2 decline across conditions, with..."}
{"text": "This study investigated the influence of physical activity (PA) levels on the long-term retention of the effects on cardiac autonomic control, assessed by heart rate variability (HRV), following a 16-week high-speed resistance training (HSRT) program over a 12-month follow-up period. At 12-month follow-up period, 36 participants who completed the measurements were categorized into light activity group (LAG) and moderate-to-vigorous activity group (MVAG) based on their PA levels. HRV data were recorded over a 6-min period. Significant within-group differences were observed over time. In MVAG, systolic blood pressure was significantly lower at the 6-month follow-up compared to pre-intervention (d unb = -0.87), while in LAG, diastolic blood pressure was lower at the 12-month follow-up compared to post-intervention (d unb = -0.66). Additionally, MVAG demonstrated significantly higher mean RR values at the 12-month compared to the 6-month follow-up (d unb = 0.49). Moreover, minimum and mean heart rate values were significantly higher..."}
{"text": "Cardiopulmonary dysfunction in burn patients is typically caused by both the burn injury and smoke inhalation. Normally presenting with symptoms such as dyspnea, decreased exercise tolerance, decreased maximal heart rate, and decreased arterial oxygen saturation. It has been demonstrated that physical activity helps to increase cardiorespiratory fitness. The goal of this study was to determine whether physical activity can provide additional benefits to the recovery of cardiorespiratory fitness in burn patients by examining research on the topic of physical activity's ability to enhance cardiorespiratory fitness in burn patients."}
{"text": "We examined heart rate (HR) and heart rate variability (HRV) in young and middle-aged men after a period of detraining that immediately followed the completion of an exercise training program. Eight young (27.8 ± 3.8 years) and ten middle-aged (41.9 ± 3.8 years) men were randomly assigned to complete an 8-week exercise training program that included either aerobic (young: n = 3; middle-aged: n = 2), resistance (young: n = 3; middle-aged: n = 3), or combined (aerobic/resistance) (young: n = 2; middle-aged: n = 5) exercise. Thereafter, participants ceased all planned exercise training activities during an 8-week detraining period. Resting HR and HRV were assessed at baseline, after exercise training, and after detraining. An analysis of mean differences between age groups at each time-point revealed a significantly higher standard deviation of normal RR intervals (SDNN), square root of the mean of squared differences between successive RR intervals (RMSSD), high-frequency..."}
{"text": "Cardiovascular complications, including myocardial ischemia, can occur during acute asthma exacerbations due to overlapping inflammatory and physiological mechanisms. ECG abnormalities and elevated cardiac biomarkers may mimic acute coronary syndrome, complicating diagnosis and management. We present a case of a 60-year-old woman with a history of long-standing asthma and hypertension who presented with chest pain and shortness of breath during an asthma exacerbation. Clinical evaluation revealed diffuse wheezing, deep T-wave inversions on ECG, and elevated cardiac biomarkers, initially raising concern for Wellens syndrome. Transthoracic echocardiography showed mild left ventricular hypertrophy and regional wall motion abnormalities, but coronary angiography demonstrated no obstructive coronary artery disease. The patient's symptoms and oxygen saturation improved with bronchodilator and corticosteroid therapy, supporting a diagnosis of pseudo-Wellens syndrome in the setting of status asthmaticus. This case highlights the importance of recognizing pseudo-Wellens syndrome as a potential mimic of true myocardial ischemia to avoid unnecessary invasive procedures and..."}
