{
    "name": "Aiden",
    "description": "Steady and methodical coach persona",
    "tone": "steady_pushy",
    "phrases": {
        "set_start": [
            "Let's begin this set with focus and precision.",
            "Time to execute this set with your full attention.",
            "Approach this set methodically. Quality over quantity.",
            "Begin with control. Every rep matters in the process.",
            "Start strong, finish stronger. Maintain your form.",
            "This set requires your complete focus. Let's proceed.",
            "Begin systematically. Control is your greatest strength.",
            "Approach with discipline. This set demands precision.",
            "Start with intention. Every movement has purpose.",
            "This set is about consistency. Execute with focus.",
            "Begin methodically. Your precision creates results.",
            "Approach deliberately. Quality execution matters.",
            "Start with control. This is where discipline pays off.",
            "This set requires focus. Let's maintain that standard.",
            "Begin with purpose. Every rep builds your foundation.",
            "Approach systematically. Consistency is key here.",
            "Start strong. Your focus determines the outcome.",
            "This set demands precision. Execute accordingly.",
            "Begin with intention. Control your movement.",
            "Approach methodically. This is about quality work.",
            "Start with discipline. Every rep has significance.",
            "This set requires your attention. Focus accordingly.",
            "Begin deliberately. Precision creates lasting results.",
            "Approach with control. This is your moment to shine.",
            "Start systematically. Quality execution is essential.",
            "This set demands focus. Maintain your standards.",
            "Begin with purpose. Every movement matters.",
            "Approach methodically. Consistency builds champions.",
            "Start with control. This is where you excel.",
            "This set requires precision. Execute with excellence."
        ],
        "set_end_no_pr": [
            "Set completed with solid execution. Good work.",
            "Well executed. Your consistency is showing results.",
            "Set finished. Solid performance throughout.",
            "Good completion. Your focus remained consistent.",
            "Set done. Steady execution maintained.",
            "Well performed. Your control was evident.",
            "Set completed. Consistent effort throughout.",
            "Good work. Your precision paid off.",
            "Set finished. Steady performance maintained.",
            "Well executed. Your focus was consistent.",
            "Set done. Solid execution from start to finish.",
            "Good completion. Your control remained strong.",
            "Set completed. Consistent quality maintained.",
            "Well performed. Your precision was evident.",
            "Set finished. Steady execution throughout.",
            "Good work. Your focus created results.",
            "Set done. Consistent performance maintained.",
            "Well executed. Your control was impressive.",
            "Set completed. Solid effort from beginning to end.",
            "Good completion. Your precision showed.",
            "Set finished. Steady quality maintained.",
            "Well performed. Your focus remained strong.",
            "Set done. Consistent execution throughout.",
            "Good work. Your control created results.",
            "Set completed. Steady performance evident.",
            "Well executed. Your precision was consistent.",
            "Set finished. Solid focus maintained.",
            "Good completion. Your control paid dividends.",
            "Set done. Consistent quality throughout.",
            "Well performed. Your focus created steady progress."
        ],
        "set_end_pr": [
            "Personal record achieved. Your consistent effort paid off.",
            "New personal best. Steady progress creates these moments.",
            "Record broken. Your methodical approach delivered results.",
            "Personal record set. Consistency and focus created this.",
            "New best achieved. Your steady execution was rewarded.",
            "Record surpassed. Methodical progress leads to breakthroughs.",
            "Personal best reached. Your consistent effort delivered.",
            "New record set. Steady focus and precision created this.",
            "Personal record broken. Your methodical approach succeeded.",
            "New best achieved. Consistent execution leads to records.",
            "Record surpassed. Your steady progress was rewarded.",
            "Personal best set. Focus and consistency delivered.",
            "New record achieved. Methodical effort created this moment.",
            "Personal record broken. Your steady approach paid off.",
            "New best reached. Consistent focus leads to breakthroughs.",
            "Record set. Your methodical execution was rewarded.",
            "Personal best achieved. Steady progress creates records.",
            "New record broken. Your consistent effort delivered.",
            "Personal record surpassed. Methodical focus paid dividends.",
            "New best set. Your steady execution was successful.",
            "Record achieved. Consistent approach leads to results.",
            "Personal best broken. Your methodical progress rewarded.",
            "New record reached. Steady focus and precision delivered.",
            "Personal record set. Your consistent effort created this.",
            "New best achieved. Methodical execution leads to records.",
            "Record surpassed. Your steady approach was successful.",
            "Personal best reached. Consistent focus delivered results.",
            "New record broken. Your methodical effort paid off.",
            "Personal record achieved. Steady progress creates breakthroughs.",
            "New best set. Your consistent execution was rewarded."
        ],
        "rest_start_standard": [
            "Rest period begins. Allow your body to recover optimally.",
            "Recovery phase initiated. Use this time effectively.",
            "Rest interval started. Your body needs this recovery time.",
            "Recovery window open. Let your systems replenish.",
            "Rest period active. Focus on controlled breathing.",
            "Recovery phase begun. Your body is rebuilding now.",
            "Rest interval initiated. Allow natural recovery to occur.",
            "Recovery window started. Use this time for restoration.",
            "Rest period commenced. Your muscles are recovering.",
            "Recovery phase active. Let your body reset naturally.",
            "Rest interval begun. Focus on the recovery process.",
            "Recovery window open. Your systems are replenishing.",
            "Rest period started. Allow optimal recovery to happen.",
            "Recovery phase initiated. Use this time effectively.",
            "Rest interval active. Your body needs this restoration.",
            "Recovery window begun. Let natural processes work.",
            "Rest period commenced. Focus on controlled recovery.",
            "Recovery phase started. Your muscles are rebuilding.",
            "Rest interval initiated. Allow the recovery process.",
            "Recovery window active. Use this time for replenishment.",
            "Rest period begun. Your body is resetting now.",
            "Recovery phase commenced. Let natural recovery occur.",
            "Rest interval started. Focus on the restoration process.",
            "Recovery window initiated. Your systems are recovering.",
            "Rest period active. Allow optimal recovery time.",
            "Recovery phase begun. Use this window effectively.",
            "Rest interval commenced. Your body needs restoration.",
            "Recovery window started. Let natural processes work.",
            "Rest period initiated. Focus on controlled breathing.",
            "Recovery phase active. Your muscles are rebuilding now."
        ],
        "rest_ready_30": [
            "Recovery progressing well. Your body is responding optimally.",
            "Heart rate dropping steadily. Good recovery trajectory.",
            "Recovery metrics solid. Your body is recovering efficiently.",
            "Heart rate normalization proceeding. Steady recovery pace.",
            "Recovery phase effective. Your systems are responding well.",
            "Heart rate drop consistent. Good recovery efficiency.",
            "Recovery metrics strong. Your body is performing optimally.",
            "Heart rate stabilization progressing. Solid recovery work.",
            "Recovery phase efficient. Your systems are recovering well.",
            "Heart rate drop steady. Good recovery trajectory maintained.",
            "Recovery metrics consistent. Your body is responding optimally.",
            "Heart rate normalization solid. Steady recovery pace.",
            "Recovery phase effective. Your systems are performing well.",
            "Heart rate drop maintained. Good recovery efficiency.",
            "Recovery metrics strong. Your body is recovering optimally.",
            "Heart rate stabilization consistent. Solid recovery work.",
            "Recovery phase efficient. Your systems are responding well.",
            "Heart rate drop steady. Good recovery trajectory.",
            "Recovery metrics solid. Your body is performing optimally.",
            "Heart rate normalization progressing. Steady recovery pace.",
            "Recovery phase effective. Your systems are recovering well.",
            "Heart rate drop consistent. Good recovery efficiency.",
            "Recovery metrics strong. Your body is responding optimally.",
            "Heart rate stabilization solid. Steady recovery work.",
            "Recovery phase efficient. Your systems are performing well.",
            "Heart rate drop maintained. Good recovery trajectory.",
            "Recovery metrics consistent. Your body is recovering optimally.",
            "Heart rate normalization steady. Solid recovery pace.",
            "Recovery phase effective. Your systems are performing well.",
            "Heart rate drop solid. Good recovery efficiency maintained."
        ],
        "rest_ready_60": [
            "Recovery continuing steadily. Your body is maintaining efficiency.",
            "Heart rate stabilization progressing. Consistent recovery pace.",
            "Recovery metrics holding strong. Your systems are performing well.",
            "Heart rate normalization steady. Good sustained recovery.",
            "Recovery phase maintaining efficiency. Your body is responding optimally.",
            "Heart rate drop continuing. Solid recovery trajectory.",
            "Recovery metrics consistent. Your systems are recovering well.",
            "Heart rate stabilization maintained. Steady recovery work.",
            "Recovery phase holding strong. Your body is performing optimally.",
            "Heart rate normalization progressing. Consistent recovery pace.",
            "Recovery metrics steady. Your systems are responding well.",
            "Heart rate drop maintained. Good sustained recovery efficiency.",
            "Recovery phase consistent. Your body is performing optimally.",
            "Heart rate stabilization solid. Steady recovery trajectory.",
            "Recovery metrics holding. Your systems are recovering well.",
            "Heart rate normalization maintained. Good recovery work.",
            "Recovery phase steady. Your body is responding optimally.",
            "Heart rate drop consistent. Solid recovery efficiency.",
            "Recovery metrics maintained. Your systems are performing well.",
            "Heart rate stabilization progressing. Steady recovery pace.",
            "Recovery phase holding strong. Your body is performing optimally.",
            "Heart rate normalization steady. Consistent recovery work.",
            "Recovery metrics solid. Your systems are recovering well.",
            "Heart rate drop maintained. Good recovery trajectory.",
            "Recovery phase consistent. Your body is responding optimally.",
            "Heart rate stabilization solid. Steady recovery efficiency.",
            "Recovery metrics maintained. Your systems are performing well.",
            "Heart rate normalization progressing. Consistent recovery pace.",
            "Recovery phase steady. Your body is performing optimally.",
            "Heart rate drop solid. Good sustained recovery work."
        ],
        "rest_force_90": [
            "Recovery time complete. Time to resume with renewed focus.",
            "Rest period concluded. Your body has recovered sufficiently.",
            "Recovery window closed. Proceed to the next set.",
            "Rest interval finished. Your systems are ready to continue.",
            "Recovery phase complete. Time to maintain momentum.",
            "Rest period ended. Your body has been restored.",
            "Recovery window concluded. Proceed with the next movement.",
            "Rest interval complete. Your systems are replenished.",
            "Recovery phase finished. Time to continue the work.",
            "Rest period concluded. Your body is ready to proceed.",
            "Recovery window closed. Maintain your focus moving forward.",
            "Rest interval ended. Your systems have recovered.",
            "Recovery phase complete. Time to resume the sequence.",
            "Rest period finished. Your body has been restored.",
            "Recovery window concluded. Proceed systematically.",
            "Rest interval complete. Your systems are ready.",
            "Recovery phase ended. Time to continue with focus.",
            "Rest period concluded. Your body has recovered.",
            "Recovery window closed. Proceed to the next set.",
            "Rest interval finished. Your systems are replenished.",
            "Recovery phase complete. Time to maintain consistency.",
            "Rest period ended. Your body is ready to continue.",
            "Recovery window concluded. Proceed with precision.",
            "Rest interval complete. Your systems have recovered.",
            "Recovery phase finished. Time to resume the work.",
            "Rest period concluded. Your body has been restored.",
            "Recovery window closed. Proceed systematically.",
            "Rest interval ended. Your systems are ready.",
            "Recovery phase complete. Time to continue with focus.",
            "Rest period finished. Your body has recovered sufficiently."
        ],
        "exercise_transition": [
            "Set complete. Transition to the next exercise systematically.",
            "Well executed. Move to the following movement with focus.",
            "Set finished. Prepare for the next exercise in sequence.",
            "Good completion. Transition to the upcoming movement.",
            "Set done. Move to the next exercise with precision.",
            "Well performed. Prepare for the following challenge.",
            "Set completed. Transition systematically to the next.",
            "Good work. Move to the next exercise with focus.",
            "Set finished. Prepare for the upcoming movement.",
            "Well executed. Transition to the next in sequence.",
            "Set done. Move to the following exercise precisely.",
            "Good completion. Prepare for the next challenge.",
            "Set completed. Transition to the upcoming movement.",
            "Well performed. Move to the next exercise systematically.",
            "Set finished. Prepare for the following in sequence.",
            "Good work. Transition to the next movement with focus.",
            "Set done. Move to the upcoming exercise precisely.",
            "Well executed. Prepare for the next challenge.",
            "Set completed. Transition systematically to the following.",
            "Good completion. Move to the next exercise with precision.",
            "Set finished. Prepare for the upcoming movement.",
            "Well performed. Transition to the next in sequence.",
            "Set done. Move to the following exercise with focus.",
            "Good work. Prepare for the next challenge systematically.",
            "Set completed. Transition to the upcoming movement.",
            "Well executed. Move to the next exercise precisely.",
            "Set finished. Prepare for the following in sequence.",
            "Good completion. Transition to the next movement with focus.",
            "Set done. Move to the upcoming exercise systematically.",
            "Well performed. Prepare for the next challenge with precision."
        ]
    }
}