{
    "name": "Alice",
    "description": "Encouraging and firm coach persona",
    "tone": "encouraging_firm",
    "phrases": {
        "set_start": [
            "Let's crush this set! Give me everything you've got.",
            "Time to dig deep and show what you're made of.",
            "Push through that burn - you're stronger than you think!",
            "Every rep counts. Make each one count today.",
            "Channel that fire within. This set is yours to dominate.",
            "No holding back now. Let's see that championship effort!",
            "Feel the power building. Unleash it on this set!",
            "You've trained for this moment. Own every single rep.",
            "Dig deeper than yesterday. Push past your limits!",
            "This is where champions are made. Rise to the challenge!",
            "Transform that doubt into determination. Let's go!",
            "Your body is capable of more. Prove it right now!",
            "Embrace the struggle - it's making you unbreakable.",
            "Fuel that inner fire. Let it drive every rep!",
            "You're not just lifting weights, you're building your legacy.",
            "Push through the pain. The breakthrough is on the other side!",
            "This set is your canvas. Paint it with pure effort!",
            "Feel that strength surging. Channel it into victory!",
            "No excuses, no regrets. Give me maximum effort!",
            "You're a warrior in this gym. Fight for every rep!",
            "Break through those mental barriers. You're unstoppable!",
            "This is your moment to shine. Make it legendary!",
            "Push harder than you ever have before. You can do this!",
            "Feel the burn, embrace the gain. This set transforms you!",
            "You're not tired, you're just getting started. Push on!",
            "Channel your inner champion. This set is yours to win!",
            "Every drop of sweat is a step toward greatness. Keep going!",
            "This is where the magic happens. Give it everything!",
            "Push past the comfort zone. That's where growth lives!",
            "You're capable of extraordinary things. Prove it now!"
        ],
        "set_end_no_pr": [
            "Solid work! That effort is building your foundation.",
            "Good push through that set. Recovery time now.",
            "Nice grind! Feel that strength growing within you.",
            "Well executed. Your consistency is paying off.",
            "Strong finish! That burn means you're getting stronger.",
            "Great effort on that set. Take a moment to breathe.",
            "You're building momentum. Keep that intensity going.",
            "Solid execution. Your form is getting sharper.",
            "Good work staying focused. The results will follow.",
            "That set showed real determination. Well done!",
            "You're getting more efficient with every rep.",
            "Nice work maintaining that pace. Recovery phase now.",
            "Your effort is consistent. That's how champions are built.",
            "Good job pushing through. Feel the progress?",
            "That set demonstrated real mental toughness.",
            "Well executed sequence. Your body is adapting.",
            "Great job staying locked in. The gains are coming.",
            "Solid performance. You're building lasting strength.",
            "Nice work through the burn. Recovery time earned.",
            "Your consistency is creating real momentum.",
            "Good effort maintaining focus. The foundation is strong.",
            "That set showed great control. Well executed!",
            "You're getting stronger with every session.",
            "Nice work pushing your limits safely.",
            "Solid foundation building. Keep stacking those sets!",
            "Your effort is creating lasting change.",
            "Good job staying present. The results will show.",
            "That set demonstrated real discipline.",
            "Well done maintaining that intensity.",
            "You're building a stronger version of yourself."
        ],
        "set_end_pr": [
            "NEW PERSONAL RECORD! That's what champions are made of!",
            "PR ALERT! You just rewrote your limits!",
            "INCREDIBLE! That PR is a testament to your dedication!",
            "MILESTONE UNLOCKED! You're officially stronger today!",
            "RECORD BROKEN! Feel that power surging through you!",
            "PR ACHIEVED! This is the moment you trained for!",
            "NEW BEST! You're not just lifting, you're evolving!",
            "RECORD SMASHED! Your hard work is paying dividends!",
            "PERSONAL BEST! This is your breakthrough moment!",
            "PR CONQUERED! You're capable of extraordinary things!",
            "NEW RECORD! This is the power of consistent effort!",
            "MILESTONE REACHED! You're rewriting your story!",
            "PR DOMINATED! Feel the confidence building!",
            "RECORD BROKEN! This is what dedication looks like!",
            "NEW PERSONAL BEST! You're unstoppable now!",
            "PR ACHIEVED! This changes everything!",
            "RECORD SMASHED! Your potential is limitless!",
            "MILESTONE UNLOCKED! You're a different athlete now!",
            "PR CONQUERED! This is your transformation moment!",
            "NEW BEST! Feel the strength of your commitment!",
            "RECORD BROKEN! You're building something special!",
            "PR ALERT! This is the breakthrough you earned!",
            "NEW RECORD! Your dedication is creating miracles!",
            "MILESTONE REACHED! You're stronger than yesterday!",
            "PR DOMINATED! This is your victory lap!",
            "RECORD SMASHED! Feel that champion energy!",
            "NEW PERSONAL BEST! You're rewriting the rules!",
            "PR ACHIEVED! This is your power moment!",
            "RECORD BROKEN! Your effort is legendary!",
            "MILESTONE UNLOCKED! You're just getting started!"
        ],
        "rest_start_standard": [
            "Take this rest. Your body needs it to perform at its best.",
            "Recovery time. Use it wisely - hydrate and prepare mentally.",
            "Rest phase activated. Let your muscles replenish their energy.",
            "Strategic break. This is when the magic of recovery happens.",
            "Rest period. Feel your heart rate coming down naturally.",
            "Recovery window. Your body is rebuilding stronger right now.",
            "Rest time earned. Use it to visualize your next set's success.",
            "Break time. Let your nervous system reset and recharge.",
            "Recovery phase. This is where your strength gets renewed.",
            "Rest interval. Your muscles are absorbing the benefits of that work.",
            "Strategic pause. This rest is making you more powerful.",
            "Recovery time. Feel the energy returning to your muscles.",
            "Rest period. Your body is adapting and growing stronger.",
            "Break earned. Use this time to focus on your breathing.",
            "Recovery window. This is when your gains are being cemented.",
            "Rest phase. Let your heart rate normalize and strength return.",
            "Strategic rest. This break is optimizing your performance.",
            "Recovery time. Your muscles are replenishing their power stores.",
            "Rest interval. Feel the difference this recovery is making.",
            "Break time. This is where champions recharge their batteries.",
            "Recovery phase. Your body is becoming more efficient.",
            "Rest period. Use this time to mentally prepare for dominance.",
            "Strategic pause. This rest is building your resilience.",
            "Recovery window. Feel the strength returning to your muscles.",
            "Rest time. Your nervous system is resetting for peak performance.",
            "Break earned. This recovery is making you unstoppable.",
            "Recovery phase. Your body is adapting to become stronger.",
            "Rest interval. Use this time to visualize crushing your next set.",
            "Strategic rest. This break is optimizing your entire system.",
            "Recovery time. Feel the power building for your next effort."
        ],
        "rest_ready_30": [
            "Heart rate dropping nicely. You're recovering like a champion!",
            "Great recovery! Your body is bouncing back strong.",
            "Excellent heart rate drop. You're ready to dominate again!",
            "Recovery looking solid. That drop shows real conditioning.",
            "Nice work on that recovery. Your body is performing optimally.",
            "Heart rate normalizing beautifully. Great recovery efficiency!",
            "Solid recovery metrics. You're building championship stamina.",
            "Excellent heart rate response. Your conditioning is elite!",
            "Recovery phase crushing it. You're ready for the next challenge.",
            "Great heart rate drop! Your body is adapting perfectly.",
            "Recovery efficiency is impressive. You're a recovery master!",
            "Heart rate stabilizing well. Your conditioning is paying off.",
            "Solid recovery numbers. You're performing like an athlete.",
            "Excellent heart rate normalization. Great work!",
            "Recovery metrics looking strong. You're building real resilience.",
            "Heart rate dropping efficiently. Your body is recovering like a pro.",
            "Great recovery response. You're optimizing your performance.",
            "Solid heart rate drop. Your conditioning is championship level.",
            "Recovery phase performing well. You're ready to push limits.",
            "Excellent heart rate stabilization. Your body is elite!",
            "Great recovery efficiency. You're a true athlete in this process.",
            "Heart rate normalizing perfectly. Solid conditioning work.",
            "Recovery metrics impressive. You're building lasting strength.",
            "Excellent heart rate response. Your body is performing optimally.",
            "Solid recovery numbers. You're ready for championship efforts.",
            "Great heart rate drop. Your conditioning is creating advantages.",
            "Recovery efficiency elite. You're performing at a high level.",
            "Heart rate stabilizing well. Your body is adapting beautifully.",
            "Excellent recovery response. You're a recovery specialist!",
            "Solid heart rate normalization. Your conditioning is paying dividends."
        ],
        "rest_ready_60": [
            "Recovery still progressing well. Your body is performing optimally.",
            "Heart rate continuing to drop. Great sustained recovery!",
            "Solid recovery trajectory. You're building championship conditioning.",
            "Recovery efficiency holding strong. Your body is elite.",
            "Heart rate normalization continuing. Excellent conditioning work.",
            "Recovery metrics staying solid. You're performing like a pro.",
            "Great sustained recovery. Your body is adapting beautifully.",
            "Heart rate drop maintaining pace. Solid conditioning foundation.",
            "Recovery phase still efficient. You're building real resilience.",
            "Excellent continued recovery. Your conditioning is paying off.",
            "Heart rate stabilization progressing. Great work maintaining it.",
            "Recovery efficiency impressive. You're a true recovery athlete.",
            "Solid sustained recovery. Your body is performing optimally.",
            "Heart rate normalization continuing well. Elite conditioning.",
            "Recovery metrics holding strong. You're championship material.",
            "Great continued heart rate drop. Your conditioning is elite.",
            "Recovery trajectory excellent. You're building lasting strength.",
            "Heart rate stabilization solid. Your body is adapting perfectly.",
            "Excellent sustained recovery. You're performing at high level.",
            "Recovery efficiency maintained. Your conditioning is paying dividends.",
            "Heart rate drop continuing well. Solid foundation building.",
            "Great recovery maintenance. You're a conditioning specialist.",
            "Recovery metrics staying impressive. Your body is elite.",
            "Heart rate normalization progressing. Excellent sustained work.",
            "Solid continued recovery. You're building championship stamina.",
            "Recovery efficiency holding. Your conditioning is creating advantages.",
            "Heart rate stabilization excellent. You're performing optimally.",
            "Great sustained recovery pace. Your body is adapting beautifully.",
            "Recovery trajectory solid. You're a true athlete.",
            "Excellent continued heart rate drop. Your conditioning foundation is strong."
        ],
        "rest_force_90": [
            "Time to move on. Your body has recovered - let's use that energy!",
            "Recovery complete. It's time to channel that renewed strength!",
            "Rest period maximized. Now let's put that recovery to work!",
            "Recovery window closed. Time to unleash that built-up power!",
            "Rest time complete. Your muscles are primed and ready!",
            "Recovery achieved. Let's transform that energy into results!",
            "Rest phase done. Time to put your recovery to the test!",
            "Recovery complete. Your body is stronger and ready to perform!",
            "Rest interval finished. Let's make this next set legendary!",
            "Recovery maximized. Time to show what that rest built!",
            "Rest period complete. Your strength has been renewed!",
            "Recovery achieved. Let's channel that power into victory!",
            "Rest time done. Your muscles are recharged and ready!",
            "Recovery complete. Time to push your renewed limits!",
            "Rest phase finished. Let's make every rep count!",
            "Recovery maximized. Your body is primed for greatness!",
            "Rest interval complete. Time to unleash that stored energy!",
            "Recovery achieved. Let's transform rest into results!",
            "Rest period done. Your strength is renewed and ready!",
            "Recovery complete. Time to dominate with renewed power!",
            "Rest time finished. Let's make this set your best yet!",
            "Recovery maximized. Your muscles are charged and ready!",
            "Rest phase complete. Time to channel that recovery energy!",
            "Recovery achieved. Let's push past previous limits!",
            "Rest interval done. Your body is stronger than before!",
            "Recovery complete. Time to show your renewed capabilities!",
            "Rest period finished. Let's make this next effort legendary!",
            "Recovery maximized. Your strength has been rebuilt!",
            "Rest time complete. Time to unleash that championship power!",
            "Recovery achieved. Let's transform energy into excellence!"
        ],
        "exercise_transition": [
            "Excellent work! Now let's transition to the next movement.",
            "Great set completed. Time to shift gears to the next exercise.",
            "Well done! Let's move efficiently to your next challenge.",
            "Set complete. Prepare yourself for the upcoming movement.",
            "Good work! Now let's transition smoothly to the next exercise.",
            "Excellent execution. Time to move to the following movement.",
            "Well completed! Let's prepare for the next exercise in sequence.",
            "Set finished. Transition time to the upcoming challenge.",
            "Great effort! Now let's move to the next exercise with focus.",
            "Well done! Time to transition to the following movement.",
            "Set complete. Prepare mentally for the next exercise.",
            "Excellent work! Let's move efficiently to the next challenge.",
            "Well executed! Time to transition to the upcoming movement.",
            "Set finished. Focus on the next exercise in your sequence.",
            "Great job! Now let's prepare for the following challenge.",
            "Well completed! Time to move to the next exercise.",
            "Set done. Transition smoothly to the upcoming movement.",
            "Excellent effort! Let's move to the next exercise with purpose.",
            "Well done! Time to prepare for the following challenge.",
            "Set complete. Focus on transitioning to the next movement.",
            "Great work! Now let's move efficiently to the next exercise.",
            "Well executed! Time to transition to the upcoming challenge.",
            "Set finished. Prepare yourself for the next movement.",
            "Excellent job! Let's move to the following exercise.",
            "Well completed! Time to transition smoothly to the next challenge.",
            "Set done. Focus on the upcoming exercise in sequence.",
            "Great effort! Now let's prepare for the next movement.",
            "Well done! Time to move to the following challenge.",
            "Set complete. Transition time to the next exercise.",
            "Excellent work! Let's move efficiently to the upcoming movement."
        ]
    }
}