{"text": "Strongman diets are oftenextremely caloric, frequently reaching five figures.2018 World’s Strongest Man (WSM) and currentdeadlift record holderHafthor Björnssonrecently invitedDr. Mike Israetelto evaluate his daily meals.Björnsson’s day starts with one and a half liters of water mixed with Hydrate, anelectrolyte powder, andcreatine. His daily nutrition plan consists of five meals, which are organized when he wakes up and coordinated with his workout schedule.Björnsson consumes approximately 400 grams of protein en route to8,000 daily calories. “I used to eat10,000 calories daily. When I was younger, I was more active and needed more calories,” Björnsson recalled. “Now, I am old, lazy, and eat only 8,000.”https://www.youtube.com/watch?v=6RWCkDytuqgVideo can’t be loaded because JavaScript is disabled:Science vs Strongman: Is My Diet Optimal for Peak Strength? Ft: Dr Mike Israetel (https://www.youtube.com/watch?v=6RWCkDytuqg)Join the BarBend community ForumLooking to connect with fellow fitness lovers like you? Head over to the BarBend Community Forum to ask questions, share advice, and talk all..."}
{"text": "Collagen is a popular fitness supplement, touted for its benefits for joint health, recovery, and skin. But is it all hype?The most recent research suggestscollagenmay not live up to the claims that permeate the fitness world.Dr. Layne Norton, Ph.D. in Nutritional Sciences, doubts collagen’s value.Collagen supplementation looks like a scam. I am skeptical.—Dr. Layne NortonHow Collagen WorksCollagen is the most abundant protein in the human body, helping make up the skin, bones, tendons,ligaments, and cartilage. There are at least 16 types, but types I, II, and III are closely tied to fitness andjoint/skin health.Type I:Skin, tendons, bonesType II:CartilageType III: Skin, blood vesselsThere are four main ways collagen works in the body:Structural Support:Collagen fibers form a network that supports connective tissues, resists stretching, and maintains shape.Joint Health:Collagen, part of cartilage, cushions joints from impact and friction during movement.Skin & Tissue Repair:Collagen contributes to skin elasticity and wound healing.Amino Acid Supply:Collagen providesamino..."}
{"text": "A new study reignited the debate about the lowest repetition range to maximize musclehypertrophy. Analyzed by theHouse of Hypertrophy(HoH), the research reveals evidence that challenges conventional advice.One to five reps is considered thestrength zone, where hypertrophy is observed.Due to mechanical tension,volume, fatigue management, and joint health, the six to 12 rep range is often considered the sweet spot for muscle growth.Could a few sets of three to five reps produce similar or better growth stimulus?The StudyFourteen trained individuals with at least two years of lifting experience performed unilateralleg pressesandextensions. (1) Subjects trained one leg for three to five reps to volitional failure using heavy loads, while the other leg performed 20-25 repetitions to failure with lighter weights. Workouts comprised three sets per session with two-minute rest periods between sets, training twice weekly for nine weeks.https://www.youtube.com/watch?v=GpSR3oicV_I&t=291sVideo can’t be loaded because JavaScript is disabled:Can 3-5 Reps Truly Maximize Growth? (New Study) (https://www.youtube.com/watch?v=GpSR3oicV_I&t=291s)Join..."}
{"text": "Recovering from a training session doesn’t end when yourack the weights;what you eat aftercan influence your progress. PhysiologistDr. Mike Israetel, co-founder ofRenaissance Periodization, keeps hispost-workout strategysimple.Skip overcomplicated meal plans andfocus on replenishingglycogenstores quickly to recover andbuild more muscle.https://www.youtube.com/watch?v=wXrMSW72Mi8&t=0sVideo can’t be loaded because JavaScript is disabled:Post Workout Meals For Size and Strength Ft. Dr. Mike (https://www.youtube.com/watch?v=wXrMSW72Mi8&t=0s)Join the BarBend community ForumLooking to connect with fellow fitness lovers like you? Head over to the BarBend Community Forum to ask questions, share advice, and talk all things training.Join the ConversationPost-Workout Nutrition: Why It’s KeyIntense training sessions drain the body’scarbohydratereserves, which muscles depend on for performance. If those stores stay low, it can slow recovery and reduce the ability to grow muscle. (1)Pairing carbs with quality protein restores glycogen and spares muscle tissue from further breakdown.Carbs are massively anti-catabolic. They prevent muscle loss to a huge extent.—Dr. Mike IsraetelPerfect Post-Workout MealHigh Carbs: Whole-grain bread delivers..."}
{"text": "ShareShareLinkClose shareCopy linkBy: Dr. Derek WilcoxDerek Wilcox, PhD, is a sports physiologist and performance coach who helps clients of all levels improve body composition, strength, and longevity through evidence-based training, nutrition, and biomechanical assessments. As the U.S. Army’s Head Powerlifting Coach and a multi-sport competitor, he blends science, compassion, and practical strategies to deliver adaptable, results-driven coaching.The Narrowing Window of Fitness Success After 35Try to find a more frustrated and annoyed group than people over 35 who exercise and diet consistently without making progress toward their body composition and performance goals. Go ahead. I’ll wait.If you really want to see their frustration level spike, have someone in their 20s explain how simple the process is “based on the science.” Technically, they are correct: calories in versus calories out still drives weight gain and loss. Resistance training is the key to gaining muscle. Proteins, fats, and carbohydrates remain the main nutrients..."}
{"text": "ShareShareLinkClose shareCopy linkBy Eric Trexler, PhDEric Trexler is a Lecturing Fellow at Duke University where he teaches and conducts research related to exercise and nutrition. He is a former strength coach and pro natural bodybuilder who has published over 60 peer-reviewed papers about getting bigger, stronger, leaner, and healthier.Caffeine is everywhere. It’s the most frequently consumed psychoactive substance on the planet, it’s regularly consumed by over 80% of American adults, and in some cultures average daily intakeexceeds 400mg/day. It’s been used for thousands of years across numerous cultures. It was briefly a banned substance, then made a remarkable comeback. All in all, caffeine has had an interesting life, and it’s currently riding high on a wave of popularity.Figure 1:Average daily caffeine intake by countryCaption: Image source:https://journals.lww.com/co-lipidology/fulltext/2007/02000/coffee,_caffeine,_and_coronary_heart_disease.5.aspxPublished research framed caffeinated beverages (namely coffee) as harmful in the 1980s, but research flipped that perspective entirely by the early 2000s. Over the last..."}
{"text": "ShareShareLinkClose shareCopy linkBy Dr. Derek WilcoxDr. Derek Wilcox, PhD in Sport Physiology and Performance, is the US Army Head Powerlifting Coach and a record-setting powerlifter. A longtime RP coach, he combines world-class competitive experience in multiple sports with advanced academic expertise to deliver science-backed, results-driven coaching for athletes and everyday clients alike.A Unique OpportunityThis year I had the opportunity to combine several of my passions into one unforgettable experience. In the spring, I was offered an adaptive powerlifting coaching position with the US Army, and I couldn’t have been more excited.My father served in the Army during Vietnam. My career as a professional powerlifter consumed my life for many years. The focus of my PhD studies was adaptive powerlifting. Somehow, all of these paths intersected and led me to the Warrior Games.What Are the Warrior Games?You can watch coverage of the Warrior Games Powerlifting event on Disney Plus, ESPN Plus,..."}
{"text": "ShareShareLinkClose shareCopy linkBy: Dr. Stacie BarberI Thought I Knew What Recovery Meant Until I Was the One on CrutchesAs a physical therapist, I’ve spent my career helping others navigate the recovery process. I’ve rehabbed athletes through post-op setbacks, managed nagging overuse injuries, and guided people back to the sports and lives they love.But nothing prepared me for the emotional and physical challenge of healing my own body.When I ruptured my Achilles tendon, I thought I could “out-discipline” the injury. I couldn’t train like I used to, so I figured I’d take the opportunity to lean out. I cut my calories, tightened up my food choices, and treated my nutrition like a cutting phase. I assumed that injury meant inactivity, and inactivity meant I needed fewer calories.What I didn’t realize was that healing is one of the most metabolically demanding things your body can go through. I was starving myself right..."}
{"text": "ShareShareLinkClose shareCopy linkBy Eric Trexler, PhDEric Trexler is a Lecturing Fellow at Duke University where he teaches and conducts research related to exercise and nutrition. He is a former strength coach and pro natural bodybuilder who has published over 60 peer-reviewed papers about getting bigger, stronger, leaner, and healthier.Should you take creatine?Sincearound 1992, lifters have answered with a very confident “yes.” But we’ve learned a lot about creatine since then, and a surprising amount of that learning has occurred in the last couple years. So, let’s take a closer look at the most important takeaways from recent creatine research.What Does Creatine Do?Our cells need chemical energy to do their jobs. But not just any chemical energy – adenosine triphosphate (ATP) specifically. When you go on vacation to a country halfway around the world, you often need to exchange your native currency for whatever is used in that faraway land so..."}
{"text": "ShareShareLinkClose shareCopy linkBy: Gerald ErnatProtein isn’t just a buzzword tossed around by fitness influencers. It’s one of the most essential nutrients in your diet, playing a key role in muscle repair and growth, hormone production, immune function, and more.But despite how common high-protein diets are, especially in fitness circles and all over social media, there’s still a surprising amount of misinformation floating around.Let’s cut through the noise and break down seven of the most common protein myths, using real science and practical takeaways you can actually apply.1. “You can only absorb 30 grams of protein per meal.”This myth just won’t die.You’ve probably heard that your body “can’t use” more than 30 grams of protein at a time, and anything extra goes to waste. But the truth is, your body absorbs and utilizes all the protein you eat. It just uses it in different ways.Here’s where the confusion comes from: muscle..."}
{"text": "ShareShareLinkClose shareCopy linkBy: Dr. Christle Guevarra, DO, MS, CAQSMAI in Coaching: Threat or Tool? How It’s Actually Helping, Not Replacing, Your Fitness JourneyArtificial intelligence (AI) seems to be everywhere these days—from your phone recommending playlists to apps summarizing long emails. Naturally, it’s making its way into fitness and nutrition, too. Some people see it as the end of personalized coaching. We see it as the beginning of something pretty powerful.At RP Strength, we’ve been keeping a close eye on how AI is impacting training and nutrition. Here’s the good news: AI isn’t replacing real coaches—it’s helping them work smarter, faster, and more effectively.What AI Is (and Isn’t) in FitnessAI, in simple terms, is software that analyzes patterns and generates outputs—like personalized meal suggestions or workout plans—based on data. It’s not a magic robot coach, and it definitely doesn’t understand you the way a human does. But it can process massive..."}
{"text": "ShareShareLinkClose shareCopy linkBy: Dr. Jen CaseTechnique is by far the most important aspect of success in jiu jitsu. However, when two competitors are evenly matched in terms of technique, strength becomes a crucial factor.As someone in my 40s who still wants to compete against athletes in their 20s, being physically stronger than my opponents helps offset the speed and flexibility deficits I face against younger competitors.What Makes a Good Strength Plan for Jiu Jitsu?When incorporating resistance training into your routine, you want the exercises to be:- Applicable to jiu jitsu- An efficient use of training time- Not so fatiguing that they hinder your jiu jitsu practiceI recommend focusing on four major lifting movements:This approach is both jiu jitsu-specific and time-efficient. Compound lifts allow you to target major muscle groups and smaller accessory muscles simultaneously, making each session more productive.Why These Movements MatterThese compound movements directly translate to the demands of..."}
{"text": "ShareShareLinkClose shareCopy linkIntroducing the newest RP StrengtheCookbookSerious nutrition solutions for serious physique athletes.At RP Strength, we’re always working to deliver practical, evidence-based tools to help athletes maximize performance, recovery, and physique progress. That’s why we’re excited to introduce our newest FREERP eCookbook.This digital cookbook includes14 macro-friendly recipes, carefully selected by RP experts to support hypertrophy, body composition goals, and training recovery. Whether you're cutting, maintaining, or massing, these meals offer an ideal balance ofconvenience, nutritional precision, and minimal prep time.If you’ve struggled to stay consistent with your nutrition because of time constraints, travel, or lack of culinary skills, this cookbook was designed with you in mind.Built by Experts, Backed by ExperienceThis eCookbookfeatures contributions from a diverse team of RP professionals and athletes, including:- Dr. Mike Israetel, co-founder of RP and PhD in Sport Physiology- Jared Feather, IFBB Pro and elite-level bodybuilding coach- Nick Shaw, CEO of RP Strength and IFBB..."}
{"text": "Heart rate variability (HRV), as an indicator of autonomic control, has been rarely studied during strength training application. This study investigates the acute HRV responses to intensity-matched resistance exercises, targeting similar muscle groups but performed in different body positions. Fourteen healthy females (21.6 ± 2.0 years) performed a 3-repetition maximum test (3-RM) for the squat movement in the Smith machine (SM, upright) and the leg press (LP, seated). During two subsequent visits, they randomly completed two exercise sessions in SM and LP (two sets of 10 repetitions at 50% 3-RM). HRV was assessed continuously (via ECG) throughout the interventions. At pre-exercise, the Root Mean Square of Successive Differences (RMSSD) and RR intervals (RRI) were significantly higher for the LP condition. Alpha1 of Detrended Fluctuation Analysis (DFAa1) was significantly higher with SM at rest. During exercise sessions, the LP condition revealed significantly reduced RMSSD (∆exercise: SM -1.19 ± 14.57 ms vs...."}
{"text": "Background/Objectives: Heart rate variability (HRV) is a reliable, non-invasive marker of autonomic nervous system function and is often impaired in individuals with metabolic syndrome (MetS). Physical exercise has emerged as an effective strategy to improve autonomic modulation; however, the comparative effects of different training modalities on HRV in individuals with MetS remain unclear. This systematic review and meta-analysis aimed to evaluate the impact of various exercise interventions on HRV and to identify which training types yield the most significant improvements. Methods: A systematic search was conducted in PubMed and Scopus up to April 2025. Eligible studies (n = 16) included adults with obesity and MetS (n = 752) who underwent structured exercise interventions with HRV assessments pre- and post-intervention. Standardized mean differences were calculated using random effects models. Subgroup analyses were performed based on training modality (endurance training [ET], resistance training [RT], high-intensity interval training [HIIT], and concurrent training [CT])...."}
{"text": "Resistance training plays a key role in enhancing muscular performance; however, the effects of different combinations of loading intensity and velocity loss (VL) thresholds on muscle oxygen saturation (SmO2) dynamics during exercise remain insufficiently understood. This study aimed to investigate the influence of intensity (60% vs. 80% one-repetition maximum [1RM]) and VL (20% vs. 40%) on SmO2 responses during the back squat exercise. Eighteen resistance-trained males (age: 20.06 ± 1.63 years; height: 176.78 ± 6.45 cm; body mass: 70.26 ± 9.56 kg) performed four back squat protocols - 60%1RM-VL20% (60-20), 60%1RM-VL40% (60-40), 80%1RM-VL20% (80-20), and 80%1RM-VL40% (80-40) - using a repeated-measures, counterbalanced design. Each protocol comprised three sets with 5-minute inter-set rest periods. SmO2 of the vastus lateralis was continuously monitored to determine changes in its magnitude and slope during exercise and recovery phases. Results revealed no significant differences were observed in the magnitude of SmO2 decline across conditions, with..."}
{"text": "This study investigated the influence of physical activity (PA) levels on the long-term retention of the effects on cardiac autonomic control, assessed by heart rate variability (HRV), following a 16-week high-speed resistance training (HSRT) program over a 12-month follow-up period. At 12-month follow-up period, 36 participants who completed the measurements were categorized into light activity group (LAG) and moderate-to-vigorous activity group (MVAG) based on their PA levels. HRV data were recorded over a 6-min period. Significant within-group differences were observed over time. In MVAG, systolic blood pressure was significantly lower at the 6-month follow-up compared to pre-intervention (d unb = -0.87), while in LAG, diastolic blood pressure was lower at the 12-month follow-up compared to post-intervention (d unb = -0.66). Additionally, MVAG demonstrated significantly higher mean RR values at the 12-month compared to the 6-month follow-up (d unb = 0.49). Moreover, minimum and mean heart rate values were significantly higher..."}
{"text": "Cardiopulmonary dysfunction in burn patients is typically caused by both the burn injury and smoke inhalation. Normally presenting with symptoms such as dyspnea, decreased exercise tolerance, decreased maximal heart rate, and decreased arterial oxygen saturation. It has been demonstrated that physical activity helps to increase cardiorespiratory fitness. The goal of this study was to determine whether physical activity can provide additional benefits to the recovery of cardiorespiratory fitness in burn patients by examining research on the topic of physical activity's ability to enhance cardiorespiratory fitness in burn patients."}
{"text": "We examined heart rate (HR) and heart rate variability (HRV) in young and middle-aged men after a period of detraining that immediately followed the completion of an exercise training program. Eight young (27.8 ± 3.8 years) and ten middle-aged (41.9 ± 3.8 years) men were randomly assigned to complete an 8-week exercise training program that included either aerobic (young: n = 3; middle-aged: n = 2), resistance (young: n = 3; middle-aged: n = 3), or combined (aerobic/resistance) (young: n = 2; middle-aged: n = 5) exercise. Thereafter, participants ceased all planned exercise training activities during an 8-week detraining period. Resting HR and HRV were assessed at baseline, after exercise training, and after detraining. An analysis of mean differences between age groups at each time-point revealed a significantly higher standard deviation of normal RR intervals (SDNN), square root of the mean of squared differences between successive RR intervals (RMSSD), high-frequency..."}
{"text": "Cardiovascular complications, including myocardial ischemia, can occur during acute asthma exacerbations due to overlapping inflammatory and physiological mechanisms. ECG abnormalities and elevated cardiac biomarkers may mimic acute coronary syndrome, complicating diagnosis and management. We present a case of a 60-year-old woman with a history of long-standing asthma and hypertension who presented with chest pain and shortness of breath during an asthma exacerbation. Clinical evaluation revealed diffuse wheezing, deep T-wave inversions on ECG, and elevated cardiac biomarkers, initially raising concern for Wellens syndrome. Transthoracic echocardiography showed mild left ventricular hypertrophy and regional wall motion abnormalities, but coronary angiography demonstrated no obstructive coronary artery disease. The patient's symptoms and oxygen saturation improved with bronchodilator and corticosteroid therapy, supporting a diagnosis of pseudo-Wellens syndrome in the setting of status asthmaticus. This case highlights the importance of recognizing pseudo-Wellens syndrome as a potential mimic of true myocardial ischemia to avoid unnecessary invasive procedures and..."}
{"text": "Judo is a high-intensity combat sport requiring substantial aerobic and anaerobic capacity. Although research has explored the physiological demands of different sports over the years, few studies have investigated the specific cardiovascular adaptations that occur in judoka. This narrative review examines these adaptations by focusing on cardiac function, heart rate variability (HRV), and hemodynamic responses, with the aim of summarizing the effects of judoka training on cardiovascular health and the relationship with athletic performance. Judo training improves aerobic capacity, with VO2max values similar to those of team sports athletes. It stimulates physiological hypertrophy of the left ventricle, improving cardiac function. Autonomic regulation shows a parasympathetic predominance, indicating better stress adaptation. Vascular adaptations include increased arterial elasticity and optimal blood pressure management, with judoka exhibiting lower blood pressure values than the general population. In summary, these adaptations promote cardiovascular health and improve athletic performance, although monitoring is essential to prevent overtraining..."}
